Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K46A.tmx
Source language: en_us
Languages: zh_cn

source: Do You Speak English?
zh_cn: 你说英语吗？

source: Manuel had passed the fish on his way up the road.
zh_cn: 曼纽尔（Manuel）沿路而行时走过了那条鱼。

source: It was eighteen to twenty inches long and its silvery scales were covered with dirt.
zh_cn: 它有18到20英寸长，它银色的鳞片上满是泥土。

source: The gill flaps opened like two gash wounds on the sides of its head as it thrashed helplessly in the gutter.
zh_cn: 它无望地在沟槽中扑打时鳃瓣张开，犹如在它头部两侧切开了两道深深的伤口。

source: Next to it a boy leaned against the railings, his rod and line dangling out over the floating garbage and the stream of brown, stinking waste which trickled from a pipe in the wall below.
zh_cn: 在它旁边有一个男孩依靠在围栏上，他的鱼竿和线悬荡在漂浮的垃圾和那股从下面墙上的管子里流淌出的褐色的、臭烘烘的污水上面。

source: The boy wore a faded pair of football shorts. He was perhaps nine or ten years old, barefoot and grubby, and his skin was marked with insect bites.
zh_cn: 那个男孩穿一条褪色的足球短裤，他大约九、十岁大，光脚，脏兮兮的，而且他的皮肤上有虫咬的痕迹。

source: The fish gasped, then made one last convulsive leap, throwing itself in the direction of the river, and landed on the pavement with a thud.
zh_cn: 那条鱼大口地喘气，然后做最后拼死一跳，将自己投向河的方向，结果砰地一声落在人行道上。

source: There it lay motionless for a moment, exhausted no doubt by the effort.
zh_cn: 在那里它一动不动地躺了一会儿，毫无疑问是由于用力而疲惫不堪。

source: The boy looked down at it, turned and kicked it back into the gutter.
zh_cn: 男孩低头看看它，转身把它踢回到沟槽里。

source: Manuel had not paid much attention to the fish as he was preoccupied.
zh_cn: 曼纽尔没太注意那条鱼，因为他心不在焉。

source: He had just been to look at an apartment and he was considering how he could afford the rent.
zh_cn: 他刚刚去看过一套公寓，他在考虑如何能付得起房租。

source: Accommodation was hard to find in the city and a place like this didn't come up very often.
zh_cn: 在城里很难找到住处，像这样的房子不常出现。

source: The apartment he and his wife were currently living in was so small their six-year-old son had to live with his wife's parents during the week.
zh_cn: 他和他妻子目前居住的公寓太小了，他们六岁的儿子不得不在每周的工作日里和他妻子的父母住在一起。

source: They had been trying to move for two years.
zh_cn: 两年了他们一直试图搬家。

source: He took out a cigarette and leaned against the railing, looking down the street at the boy fishing.
zh_cn: 他取出一支香烟，靠在围栏上，顺着街望去，看男孩钓鱼。

source: Further along the quay two figures were approaching.
zh_cn: 沿着码头再远些的地方有两个人影正在走过来。

source: He watched as they wandered slowly towards him.
zh_cn: 他看着他们慢慢溜达着朝他走来。

source: They looked to be in their early thirties and were obviously tourists, Americans he would guess.
zh_cn: 他们看起来三十出头，很明显是游客，他猜是美国人。

source: The woman had shoulder-length reddish hair and pale freckled skin.
zh_cn: 那个女人留着齐肩长的微红色头发，皮肤苍白有雀斑。

source: She was slim and athletic looking.
zh_cn: 她身材苗条，体格健美。

source: Her partner was tall and flabby, his stomach protruding from under his T-shirt.
zh_cn: 她的同伴身材高大，肌肉松弛，他的小肚子从T恤衫下突出来。

source: He wore knee-length shorts, sunglasses and his long hair was tied in a pony tail.
zh_cn: 他穿着齐膝长的短裤，戴着太阳镜，他的长发绑成一条马尾辫。

source: They came slowly along the dusty street of warehouses.
zh_cn: 他们沿着货栈中布满灰尘的街道慢慢走来。

source: Tourists were not uncommon in the city but they usually kept to the old port with its rococo churches and stately customs house, or took the organized cruises along the reef.
zh_cn: 游客在城里并不罕见，但他们通常局限在有洛可可式教堂和雄伟的海关大楼的旧港口，或者乘坐沿着礁石航行的游轮。

source: It was rare to see them in this district and Manuel assumed they were lost.
zh_cn: 很少在这个地区见到他们，曼纽尔猜想他们迷路了。

source: 'Look at the poor thing,' said the woman, stopping beside the fish, which lay where the boy had kicked it, probably now gasping its last breaths.
zh_cn: “看看这可怜的东西，”那个女人说，她停在那条鱼的旁边，那条鱼躺在那个男孩把它踢到的地方，现在大概在喘它最后的几口气。

source: She spoke with a lazy, nasal drawl.
zh_cn: 她懒洋洋地拖长了鼻音说话。

source: The boy had not turned around but he had noticed their presence.
zh_cn: 那个男孩没有转身，但他注意到了他们的存在。

source: He stared fixedly across the glittering surface of the water towards the lines of washing in the narrow streets on the opposite bank, waiting for them to go.
zh_cn: 越过闪闪发光的水面他目不转睛地盯着对岸狭窄的街道里一条条晾衣绳上的衣物，等待他们离开。

source: 'It ought to be thrown back,' the woman was saying.
zh_cn: “它应该被扔回去，”那个女人在说。

source: 'Do you think he wants it?'
zh_cn: “你认为他想要它吗？”

source: She turned to her companion who shrugged.
zh_cn: 她转向她的同伴，他耸耸肩。

source: He looked nervous.
zh_cn: 他看起来紧张不安。

source: 'I don't like the look of this neighborhood,' he said. 'I think we should get back.'
zh_cn: “我不喜欢这个地区的样子，”他说，“我想我们应该回去了。”

source: But the woman wasn't going to let it pass.
zh_cn: 但那个女人不打算就此罢手。

source: She stood there looking from the fish to the boy and back again.
zh_cn: 她站在那里从鱼看向男孩，然后又看回去。

source: 'You could try asking him,' the man said.
zh_cn: “你可以试着问问他，”那个男人说。

source: The woman stepped around the fish and approached the boy, who was still looking out across the river.
zh_cn: 女人绕过鱼，走近男孩，他仍然面朝河的那一边。

source: The child's body tensed as the woman came up to him.
zh_cn: 在女人走向他的时候，那个孩子的身体绷紧了。

source: 'Do you know that fish is dying?' Manuel heard her ask.
zh_cn: “你知道那条鱼快死了吗？”曼纽尔听到她问。

source: The boy looked up at her blankly and then shook his head. 'Dy-ing,' she repeated, drawing out each syllable, but the boy remained dumb, uncomprehending.
zh_cn: 男孩抬头茫然地看看她，然后摇摇头。“快——死——了，”她重复说，拉长了每一个音节，但男孩仍然不说话，不明所以。

source: He fidgeted awkwardly with his feet.
zh_cn: 他局促不安地挪动双脚。

source: 'I don't think he understands,' said the woman to her partner.
zh_cn: “我想他不懂，”那个女人对她的同伴说。

source: The man shrugged as if to say 'I told you we shouldn't get involved'.
zh_cn: 那个男人耸耸肩好像说“我跟你说过我们不该掺和”。

source: She looked around for assistance and noticed Manuel watching her.
zh_cn: 她四面看看寻找援助，发现曼纽尔在看她。

source: She stared at him for a moment, taking in the cream-coloured linen suit, the shoes.
zh_cn: 她盯着他看了一会儿，仔细地打量他米色的亚麻布套装、鞋子。

source: She was obviously unsure what to make of him.
zh_cn: 她明显不确定如何对待他。

source: 'Do you speak English?' she asked, this time with a more respectful tone than she had used with the boy.
zh_cn: “你说英语吗？”她问，她这次用了比对那个男孩更尊重的语气。

source: Manuel said that he did but in a voice which gave her no reason to expect his help.
zh_cn: 曼纽尔说他会但却用一种不给她任何理由指望他帮助的声音。

source: She held his gaze for a few moments.
zh_cn: 她直直地盯了他一会儿。

source: 'Can you ask this boy what he means to do with the fish?
zh_cn: “你能问一下这个男孩他打算如何处理这条鱼吗？

source: It seems so cruel, it ought to be thrown back.'
zh_cn: 这好像太残忍了，它应该被扔回去。”

source: He looked across at the boy and then at the woman.
zh_cn: 他看看那边的男孩，然后又看看这个女人。

source: He wondered if he should tell her about the kind of life this boy led, about the squalid shacks down by the beach from where he had probably come that morning, about the parents struggling to make ends meet.
zh_cn: 他不知道是否应该告诉她关于这个男孩过的那种生活、关于海滩边上脏乱的棚户区（他今天早上大概就是从那里过来的）、关于那些拼命维持生活的父母们。

source: Two days earlier he had read in the local paper about a fishing community a few miles up the coast which was being evicted to make way for a new hotel.
zh_cn: 两天前他在当地的报纸上看到沿海岸过去几英里处的一个渔村被驱逐给一个新酒店让路。

source: The boy was watching them anxiously.
zh_cn: 那个男孩不安地看着他们。

source: 'Esta senhora quer saber o que voce vai fazer com o peixe,' he said to the boy.
zh_cn: “这位女士想知道你要如何处理这条鱼（Esta senhora quer saber o que voce vai fazer com o peixe），”他对男孩说。

source: He treated the boy gently, with consideration.
zh_cn: 他对男孩很温和，体谅尊重。

source: The boy wiped a dirty hand across one eye and looked at Manuel.
zh_cn: 男孩用一只脏手擦擦一只眼睛，看看曼纽尔。

source: 'E para vender,' he responded.
zh_cn: “卖了（E para vender），”他回答说。

source: 'He intends to sell it,' he told the woman.
zh_cn: “他想要卖了它，”他告诉那个女人。

source: He tried to make his answer sound final, as though that was the end of the matter.
zh_cn: 他试图使他的答案听起来是不可改变的，好像那就是这件事的终结。

source: The woman hesitated, perhaps uncertain how to interpret the lack of encouragement in his voice.
zh_cn: 那个女人犹豫了，可能不确定如何理解他声音中缺乏鼓励。

source: Manuel observed her confusion.
zh_cn: 曼纽尔察觉到她的困惑。

source: Her eyes searched his face as though looking for some clue.
zh_cn: 她的眼睛探究他的脸好像在寻找一些线索。

source: Her companion shifted nervously behind her.
zh_cn: 她的同伴在她身后不安地来回移动。

source: 'Honey, I think we should go,' he said.
zh_cn: “亲爱的，我觉得我们该走了，”他说。

source: But the woman ignored him.
zh_cn: 但那个女人不理他。

source: He shuffled uncomfortably.
zh_cn: 他不安地拖着脚走来走去。

source: 'You know I really don't think you should interfere.'
zh_cn: “你知道我真的认为你不应该掺和。”

source: 'How much does the boy want for the fish?' the woman asked.
zh_cn: “男孩想要多少钱卖这条鱼？”女人问。

source: Manuel glanced at her companion with his stooped shoulders and useless bulk.
zh_cn: 曼纽尔瞥了一眼她的同伴，那个塌陷着肩膀、没用的大块头。

source: The woman's determination amused him but he did not smile.
zh_cn: 这个女人的决心使他觉得好笑，但他没笑。

source: 'A senhora quer comprar o peixe. Quanto e?'
zh_cn: “这位女士想买鱼，多少钱？（A senhora quer comprar o peixe. Quanto e）”

source: The boy named a price which was five times what he would have got for it locally.
zh_cn: 男孩报了一个五倍于他在当地可得到的价格。

source: His expression was deadpan. Only a slight clenching of his right hand betrayed the tension he was probably feeling.
zh_cn: 他面无表情，只有他右手的轻轻紧握泄露了他可能正在感觉到的紧张。

source: Manuel told her the price, adopting the same tone of voice with which he had addressed her previously, but this time he could not help smiling.
zh_cn: 曼纽尔告诉她价格，用了他先前和她说话的同样的语气，但这一次他禁不住微笑了。

source: She seemed to interpret this as friendliness.
zh_cn: 她似乎将这理解为友善。

source: She opened her purse and took out some money, peeling off a note of twice the value the boy had asked.
zh_cn: 她打开她的钱包，拿出一些钱，抽出一张两倍于男孩所要价格的钞票。

source: 'Does he have any change?' she asked.
zh_cn: “他有零钱找吗？”她问。

source: Manuel translated.
zh_cn: 曼纽尔翻译了。

source: Again the boy's right hand twitched slightly but otherwise his face wore the same expression of innocence it had before.
zh_cn: 男孩的右手再次轻微地颤动，但他的脸上却是和之前一样的单纯的表情。

source: He shook his head.
zh_cn: 他摇摇头。

source: The woman hesitated for a moment and looked across at the fish.
zh_cn: 那个女人犹豫了一会儿，看看那边的鱼。

source: Then she held out the note to the boy who took it.
zh_cn: 然后她伸手把钞票递给男孩，他接了。

source: She stooped down, picked the fish up carefully between forefinger and thumb and threw it into the river.
zh_cn: 她弯下腰，小心地用食指和拇指捡起鱼，然后扔进河里。

source: Without looking at either Manuel or the boy she turned to her companion and they went on up the road together.
zh_cn: 没有看曼纽尔也没有看那个男孩，她转向她的同伴，他们一起沿着路继续走去。

source: The man produced a handkerchief and offered it to the woman to wipe her fingers but she refused it.
zh_cn: 那个男人拿出一条手绢，给女人擦她的手指，但她拒绝了。

source: They appeared to be arguing.
zh_cn: 他们看起来好像在争论。

source: The boy stood holding the note. His expression had hardly changed.
zh_cn: 男孩拿着钞票站着，他的表情几乎没变。

source: Manuel watched the couple until they disappeared out of sight.
zh_cn: 曼纽尔看着那一对直到他们从视线中消失。

source: They did not once look back.
zh_cn: 他们一次也没回头。

source: He lit another cigarette and returned to his former position against the railings.
zh_cn: 他点燃了另一支香烟，返回到他之前靠着围栏的姿势。

source: The fish had not survived its lengthy time out of the water and was now floating amidst the debris a few feet out from the bank, washed in against the shore by the backward eddy of the current.
zh_cn: 那条鱼没有从漫长的脱水时间中幸存下来，现在漂浮在离岸几英尺远的垃圾当中，被反方向的涡流冲刷向河岸。

source: The boy climbed over the railings and down onto a ledge just above the water line.
zh_cn: 男孩爬过围栏，下到恰在水线之上的一个突起平台上。

source: He began dragging the dead fish towards him with a stick.
zh_cn: 他开始用一个棍子朝着他的方向拖拉那条死鱼。

source: When it was finally within reach he caught hold of it and tossed it up onto the road.
zh_cn: 当最终够得着时他抓住它，向上抛到路上。

source: As he clambered over the railings he grinned at Manuel.
zh_cn: 在他攀爬翻过围栏时他对曼纽尔咧嘴笑了笑。

source: The boy gathered up his rod and the fish and set off up the street.
zh_cn: 男孩收起他的鱼竿和那条鱼，动身沿着街走了。

source: Manuel watched him while he finished his cigarette.
zh_cn: 曼纽尔看着他的同时吸完了香烟。

source: Then he threw the butt down into the dirty water and made his way back the way he had come.
zh_cn: 然后他把烟头扔下肮脏的水，向他来时的路走去。
